---
title: AnalyticalNodeData
classe: Autodesk.Revit.DB.Structure.AnalyticalNodeData
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# AnalyticalNodeData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `analyticalNodeData.IsValidObject` | Boolean |
| `Void Dispose()` | `analyticalNodeData.Dispose()` | Void |
| `AnalyticalNodeData GetAnalyticalNodeData(Element)` | `AnalyticalNodeData.GetAnalyticalNodeData(element)` | AnalyticalNodeData |
| `AnalyticalNodeConnectionStatus GetConnectionStatus()` | `analyticalNodeData.GetConnectionStatus()` | AnalyticalNodeConnectionStatus |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```